gemini対応完了
